## Pandas Series :-

- It is one-dimentinol (1D) array holding data of any type.
- A pandas series is  like a columns in a table.
- pandas is like a excel for pythone it helps you work with table.
of data ,clean them ,filter them and prepare them for analysis or matine lerning.

#### 1:- pandas series can be created using list.

In [1]:
import numpy as np
import pandas as pd

In [2]:
l = [10,20,30]
type(l)

list

In [3]:
a = np.array(l)
print(a)

[10 20 30]

In [4]:
s = pd.Series(l)
print(s)

0    10
1    20
2    30
dtype: int64

In [5]:
s+10

0    20
1    30
2    40
dtype: int64

In [6]:
# convering list as series
l = [10,20,30]
s = pd.Series(l)
print(s)

0    10
1    20
2    30
dtype: int64

In [7]:
# changing index name here
l = [10,20,30]
s = pd.Series(l,index =[25,20,45])
print(s)

25    10
20    20
45    30
dtype: int64

In [8]:
l = [10,20,30]
s = pd.Series(l,index=['a','b','c'])
print(s)

a    10
b    20
c    30
dtype: int64

In [9]:
# index name also called as row names

#### 2:- Create series using 1D array

In [10]:
a = np.array([10,20,30])
s = pd.Series(a)
print(s)

0    10
1    20
2    30
dtype: int32

#### 3:- Creating series using dictionaries.

In [11]:
d = {'a':[10,20,30],'b':20,'c':30}
s = pd.Series(d)
print(s)

a    [10, 20, 30]
b              20
c              30
dtype: object

## Pandas as Dataframe:-

- A pandas data frame is a 2-dimentionol data structure like a 2 dimentinol array or table with rows and columns.
- it is a combination of multiple columns.

#### 1:- Create data fram using dictionaries

In [12]:
d = {'col1':[1,2],'col2':[3,4]}
pd.Series(d)
# dictionary to series

col1    [1, 2]
col2    [3, 4]
dtype: object

In [13]:
# dictionary to dataFrame
d = {'col1':[1,2],'col2':[3,4]}
df = pd.DataFrame(d)
df

   col1  col2
0     1     3
1     2     4

In [14]:
# DataFrame Store it as columns wise

In [15]:
type(df)

pandas.core.frame.DataFrame

In [16]:
df.shape

(2, 2)

#### 2:- Create DataFrame using nested list

In [17]:
l = [[1,2,3],[4,5,6]]
df = pd.DataFrame(l)
df

   0  1  2
0  1  2  3
1  4  5  6

#### 3:- Create Dataframe using 2D array

In [18]:
arr_2nd = np.array([[1,2,3],[4,5,6]])

In [19]:
df2 = pd.DataFrame(arr_2nd,index=['a','b'],columns=['i','j','k'])
df2

   i  j  k
a  1  2  3
b  4  5  6

In [20]:
d = np.array([[1,2,3,4],[5,6,7,8]])
df = pd.DataFrame(d)
df

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [21]:
df.ndim

2

In [22]:
df.shape

(2, 4)

In [23]:
type(df)

pandas.core.frame.DataFrame

## Pandas:-

In [24]:
d = {'Age' :[22,30,23,25,24],'Salary':[17000,17000,46000,42000,55000],'Gender': ['M','F','M','M','F']}
df = pd.DataFrame(d)
df

   Age  Salary Gender
0   22   17000      M
1   30   17000      F
2   23   46000      M
3   25   42000      M
4   24   55000      F

In [25]:
df.ndim

2

#### * Set index:-

- Purpose of set index to extract data based on index name.

In [26]:
# adding a columns.
df['s.no'] = np.arange(15,20)
df

   Age  Salary Gender  s.no
0   22   17000      M    15
1   30   17000      F    16
2   23   46000      M    17
3   25   42000      M    18
4   24   55000      F    19

In [27]:
# converting a columns
df.set_index('Gender')

        Age  Salary  s.no
Gender
M        22   17000    15
F        30   17000    16
M        23   46000    17
M        25   42000    18
F        24   55000    19

In [28]:
df1 = df.set_index('Gender')
df1

        Age  Salary  s.no
Gender
M        22   17000    15
F        30   17000    16
M        23   46000    17
M        25   42000    18
F        24   55000    19

In [29]:
df1.loc['M']   # Extracting 'M'

        Age  Salary  s.no
Gender
M        22   17000    15
M        23   46000    17
M        25   42000    18

In [30]:
df1.loc['F']     # Extracting 'F'

        Age  Salary  s.no
Gender
F        30   17000    16
F        24   55000    19

In [31]:
df['S.no'] = np.arange(15,20)
df

   Age  Salary Gender  s.no  S.no
0   22   17000      M    15    15
1   30   17000      F    16    16
2   23   46000      M    17    17
3   25   42000      M    18    18
4   24   55000      F    19    19

In [32]:
df = df.drop('s.no',axis=1)
df  # for removing any column we have to use '.drop' methode.

   Age  Salary Gender  S.no
0   22   17000      M    15
1   30   17000      F    16
2   23   46000      M    17
3   25   42000      M    18
4   24   55000      F    19

In [33]:
df1.loc[15]  # For accesing or extracting value we use '.loc' methode.

KeyError: 15

In [34]:
df1.index = [15, 16, 17, 18, 19]
print(df1)

    Age  Salary  s.no
15   22   17000    15
16   30   17000    16
17   23   46000    17
18   25   42000    18
19   24   55000    19

In [35]:
df1.index = [15, 16, 17, 18, 19]
df1

    Age  Salary  s.no
15   22   17000    15
16   30   17000    16
17   23   46000    17
18   25   42000    18
19   24   55000    19

In [36]:
df1.loc[15]

Age          22
Salary    17000
s.no         15
Name: 15, dtype: int64

In [37]:
# If i want to drop any index (remove).
df1.drop(index=[18])

    Age  Salary  s.no
15   22   17000    15
16   30   17000    16
17   23   46000    17
19   24   55000    19

- Select and Extract is same.
- loc  :- work based on name.
- iloc :- it will work based on index number.

In [38]:
# extract a single row
df.loc[2]

Age          23
Salary    46000
Gender        M
S.no         17
Name: 2, dtype: object

In [39]:
# To extracct multiple row based on slicing.
df.loc[0:4]

   Age  Salary Gender  S.no
0   22   17000      M    15
1   30   17000      F    16
2   23   46000      M    17
3   25   42000      M    18
4   24   55000      F    19

In [40]:
df.loc[0:4:2]

   Age  Salary Gender  S.no
0   22   17000      M    15
2   23   46000      M    17
4   24   55000      F    19

In [41]:
# Extracting a multiple rows without slicing.
df.loc[[0,1,4]]

   Age  Salary Gender  S.no
0   22   17000      M    15
1   30   17000      F    16
4   24   55000      F    19

In [42]:
# Extract / select a single columns
df.loc[:,'Age']

0    22
1    30
2    23
3    25
4    24
Name: Age, dtype: int64

In [43]:
# Extracting multiple columns based in slicing.
df.loc[:,'Age':'Salary']

   Age  Salary
0   22   17000
1   30   17000
2   23   46000
3   25   42000
4   24   55000

In [44]:
df.loc[:,'Age':'Gender']

   Age  Salary Gender
0   22   17000      M
1   30   17000      F
2   23   46000      M
3   25   42000      M
4   24   55000      F

In [45]:
# extracting multiple row without slicing.
df.loc[[0,1,4]]

   Age  Salary Gender  S.no
0   22   17000      M    15
1   30   17000      F    16
4   24   55000      F    19

- loc uses row index name and column name.
- iloc uses row index number and column index number.

In [46]:
# extracting multiple column without slicing 
df.loc[:,["Age","Gender"]]

   Age Gender
0   22      M
1   30      F
2   23      M
3   25      M
4   24      F

In [47]:
# extract data selected rows and selected columns.
df.loc[[1,4],["Age","Gender"]]

   Age Gender
1   30      F
4   24      F

In [48]:
df

   Age  Salary Gender  S.no
0   22   17000      M    15
1   30   17000      F    16
2   23   46000      M    17
3   25   42000      M    18
4   24   55000      F    19

In [49]:
# iloc[]:-
df.loc[[0,4],:]

   Age  Salary Gender  S.no
0   22   17000      M    15
4   24   55000      F    19

In [50]:
df.iloc[[-1,3],:]

   Age  Salary Gender  S.no
4   24   55000      F    19
3   25   42000      M    18

In [51]:
df.iloc[[-1,-5],:]

   Age  Salary Gender  S.no
4   24   55000      F    19
0   22   17000      M    15

## reset index:-

- It will bring the table of his normal position .
- which ever index or columns have vanished it will bring them back .
- (it will fix table on his fisrt position.)

In [52]:
df1.reset_index()

   index  Age  Salary  s.no
0     15   22   17000    15
1     16   30   17000    16
2     17   23   46000    17
3     18   25   42000    18
4     19   24   55000    19

In [53]:
df

   Age  Salary Gender  S.no
0   22   17000      M    15
1   30   17000      F    16
2   23   46000      M    17
3   25   42000      M    18
4   24   55000      F    19

In [54]:
df.index =['a','b','c','d','e']
df

   Age  Salary Gender  S.no
a   22   17000      M    15
b   30   17000      F    16
c   23   46000      M    17
d   25   42000      M    18
e   24   55000      F    19

#### Drop a single row

In [55]:
df.drop(index=['b'])  # drop mean remove here

   Age  Salary Gender  S.no
a   22   17000      M    15
c   23   46000      M    17
d   25   42000      M    18
e   24   55000      F    19

- syntex :-  df.drop(index=[]).

In [56]:
#### Drop a single columns
df1 = df.drop(columns =['Age'])

In [57]:
df1

   Salary Gender  S.no
a   17000      M    15
b   17000      F    16
c   46000      M    17
d   42000      M    18
e   55000      F    19

#### Drop multiple columns

In [58]:
df.drop(columns=["Age","Gender"])

   Salary  S.no
a   17000    15
b   17000    16
c   46000    17
d   42000    18
e   55000    19

### Small Notes:-

- df.drop(index=['a','b']) ----> Drop multiple rows.
- //OR.
- df.drop(['a','b'].axis =0)---->Drop multiple rows.

- df.drop(index = ['a'])------> Drop single row.
- // OR.
- df.drop('a',axis = 0)-------> Drop single row.

In [59]:
# Creating again our old df
d ={'Age':[22,30,23,25,24],'Salary':[17000,17000,46000,42000,55000],'Gender':['M','F','M','M','F']}
df = pd.DataFrame(d,index=['a','b','c','d','e'])

In [60]:
df

   Age  Salary Gender
a   22   17000      M
b   30   17000      F
c   23   46000      M
d   25   42000      M
e   24   55000      F

#### * Sorting value in DataFrame.

In [61]:
# Sorting in ascending order.
df.sort_values(by = 'Age')

   Age  Salary Gender
a   22   17000      M
c   23   46000      M
e   24   55000      F
d   25   42000      M
b   30   17000      F

In [62]:
df.sort_values(by='Salary')

   Age  Salary Gender
a   22   17000      M
b   30   17000      F
d   25   42000      M
c   23   46000      M
e   24   55000      F

In [63]:
# Sorting in decending order.
df.sort_values(by = 'Age',ascending = False)

   Age  Salary Gender
b   30   17000      F
d   25   42000      M
e   24   55000      F
c   23   46000      M
a   22   17000      M

#### * Combing DataFrame.

In [64]:
df1 = pd.DataFrame({'city':['mumbai','delhi','banglor','hyderabad'],'Tempreture ':[32,45,40,36]})

In [65]:
df1

        city  Tempreture
0     mumbai           32
1      delhi           45
2    banglor           40
3  hyderabad           36

In [66]:
df2 = pd.DataFrame({"city":['Delhi','mumbai','banglore','chennai'],"Humidity":[68,65,75,70]})
df2

       city  Humidity
0     Delhi        68
1    mumbai        65
2  banglore        75
3   chennai        70

### * Concatenation :-

- sytex :- pd. concat ([df1 , df2, df3.......dfn] , axis = 0 )

In [67]:
pd.concat([df1,df2],axis = 0)   # columns we take ---> 0

        city  Tempreture   Humidity
0     mumbai         32.0       NaN
1      delhi         45.0       NaN
2    banglor         40.0       NaN
3  hyderabad         36.0       NaN
0      Delhi          NaN      68.0
1     mumbai          NaN      65.0
2   banglore          NaN      75.0
3    chennai          NaN      70.0

In [68]:
df10 = pd.concat([df1,df2],axis= 1) # for rows we take-----> 1
df10

        city  Tempreture       city  Humidity
0     mumbai           32     Delhi        68
1      delhi           45    mumbai        65
2    banglor           40  banglore        75
3  hyderabad           36   chennai        70

In [69]:
df3 = pd.concat([df2,df1],axis = 0)
df3

        city  Humidity  Tempreture
0      Delhi      68.0          NaN
1     mumbai      65.0          NaN
2   banglore      75.0          NaN
3    chennai      70.0          NaN
0     mumbai       NaN         32.0
1      delhi       NaN         45.0
2    banglor       NaN         40.0
3  hyderabad       NaN         36.0

In [70]:
pd.concat([df2,df1],axis=0,ignore_index = True)  # True is Keyword in concate.

        city  Humidity  Tempreture
0      Delhi      68.0          NaN
1     mumbai      65.0          NaN
2   banglore      75.0          NaN
3    chennai      70.0          NaN
4     mumbai       NaN         32.0
5      delhi       NaN         45.0
6    banglor       NaN         40.0
7  hyderabad       NaN         36.0

### * Marging of DataFrame:-

In [71]:
pd.merge(df1,df2, on ='city', how = 'outer')

        city  Tempreture   Humidity
0      Delhi          NaN      68.0
1    banglor         40.0       NaN
2   banglore          NaN      75.0
3    chennai          NaN      70.0
4      delhi         45.0       NaN
5  hyderabad         36.0       NaN
6     mumbai         32.0      65.0

##### *marging is also called join.

####  * left join:-

In [72]:
left_df = pd.merge(df1,df2 , on = 'city', how = 'left' )
left_df

        city  Tempreture   Humidity
0     mumbai           32      65.0
1      delhi           45       NaN
2    banglor           40       NaN
3  hyderabad           36       NaN

#### * right join :-

- entire right side of data fram selected

In [73]:
right_df = pd.merge(df1,df2, on = 'city', how='right')
right_df

       city  Tempreture   Humidity
0     Delhi          NaN        68
1    mumbai         32.0        65
2  banglore          NaN        75
3   chennai          NaN        70

#### * inner join :-

- common data record.

In [74]:
inner_df = pd.merge(df1,df2, on = 'city', how='inner')
inner_df

     city  Tempreture   Humidity
0  mumbai           32        65

In [75]:
# there is also delhi and bangllore but in both DataFrame the spelling is change that is why it showed only mumbai.

#### * outer join :-

- all record of both data frame.

In [76]:
outer_df = pd.merge(df1,df2, on = 'city', how = 'outer')
outer_df

        city  Tempreture   Humidity
0      Delhi          NaN      68.0
1    banglor         40.0       NaN
2   banglore          NaN      75.0
3    chennai          NaN      70.0
4      delhi         45.0       NaN
5  hyderabad         36.0       NaN
6     mumbai         32.0      65.0

#### head :- First five records and tail mean last five record

#### import data / load data

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r"C:\Users\ARSHAD ALI KHAN\Downloads\data.csv")

In [3]:
df

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [4]:
# For fisrtfive row we will use head function.
df.head()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [5]:
# for last five rows/ record
df.tail()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [6]:
# dimention of the data fram

#### * shape:-

- it will gives total number of rows.

In [7]:
df.shape

(195, 5)

#### * Size :-

- total number of vaalue howmuch is it inside.

In [8]:
# return an int represent the number of element.
df.size

975

#### * Columns :-

- It will give you column name.

In [9]:
# column name / variable name
df.columns

Index(['CountryName', 'CountryCode', 'BirthRate', 'InternetUsers',
       'IncomeGroup'],
      dtype='object')

#### * Keys():-

- it will give columns names.

In [10]:
df.keys()

Index(['CountryName', 'CountryCode', 'BirthRate', 'InternetUsers',
       'IncomeGroup'],
      dtype='object')

#### For renaming column name:-

In [11]:
df = df.rename(columns = {'CountryName':'Name_Country','CountryCode':'Code_Country'})
df

,Name_Country,Code_Country,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

#### * dtypes :-

- Data type of each column.

In [12]:
df.dtypes

Name_Country      object
Code_Country      object
BirthRate        float64
InternetUsers    float64
IncomeGroup       object
dtype: object

#### * info():-

- It is the combination of shape , columns name and Datatype.

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name_Country   195 non-null    object
 1   Code_Country   195 non-null    object
 2   BirthRate      195 non-null    float64
 3   InternetUsers  195 non-null    float64
 4   IncomeGroup    195 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB

#### Cheak for missing Value :-

In [14]:
df.isnull()  # null value mean missing value if there is missing value in the table it will give 'True'.

     Name_Country  Code_Country  BirthRate  InternetUsers  IncomeGroup
0           False         False      False          False        False
1           False         False      False          False        False
2           False         False      False          False        False
3           False         False      False          False        False
4           False         False      False          False        False
..            ...           ...        ...            ...          ...
190         False         False      False          False        False
191         False         False      False          False        False
192         False         False      False          False        False
193         False         False      False          False        False
194         False         False      False          False        False

[195 rows x 5 columns]

#### * Extractting or accesing the data

In [15]:
df.iloc[[2,3,4,5], 0]

2                  Angola
3                 Albania
4    United Arab Emirates
5               Argentina
Name: Name_Country, dtype: object

In [16]:
df.loc[[2,3,4,5],'BirthRate']

2    45.985
3    12.877
4    11.044
5    17.716
Name: BirthRate, dtype: float64

#### To extract data of single columns with all records:-

In [17]:
# 1st option :-
df.iloc[: , 0]

0                     Aruba
1               Afghanistan
2                    Angola
3                   Albania
4      United Arab Emirates
               ...
190             Yemen, Rep.
191            South Africa
192        Congo, Dem. Rep.
193                  Zambia
194                Zimbabwe
Name: Name_Country, Length: 195, dtype: object

In [18]:
# 2nd option :-
df.loc[:, 'Name_Country']

0                     Aruba
1               Afghanistan
2                    Angola
3                   Albania
4      United Arab Emirates
               ...
190             Yemen, Rep.
191            South Africa
192        Congo, Dem. Rep.
193                  Zambia
194                Zimbabwe
Name: Name_Country, Length: 195, dtype: object

In [19]:
# 3rd option :-
df.Name_Country

0                     Aruba
1               Afghanistan
2                    Angola
3                   Albania
4      United Arab Emirates
               ...
190             Yemen, Rep.
191            South Africa
192        Congo, Dem. Rep.
193                  Zambia
194                Zimbabwe
Name: Name_Country, Length: 195, dtype: object

In [21]:
# To access the data of multiple columns
df[["Name_Country", "InternetUsers"]]

             Name_Country  InternetUsers
0                   Aruba           78.9
1             Afghanistan            5.9
2                  Angola           19.1
3                 Albania           57.2
4    United Arab Emirates           88.0
..                    ...            ...
190           Yemen, Rep.           20.0
191          South Africa           46.5
192      Congo, Dem. Rep.            2.2
193                Zambia           15.4
194              Zimbabwe           18.5

[195 rows x 2 columns]

In [23]:
numerical = ["BirthRate", "InternetUsers", ]
df[["BirthRate","InternetUsers", ]]

     BirthRate  InternetUsers
0       10.244           78.9
1       35.253            5.9
2       45.985           19.1
3       12.877           57.2
4       11.044           88.0
..         ...            ...
190     32.947           20.0
191     20.850           46.5
192     42.394            2.2
193     40.471           15.4
194     35.715           18.5

[195 rows x 2 columns]

In [24]:
# Convert pandas series to 1D array.
df["Name_Country"].values

array(['Aruba', 'Afghanistan', 'Angola', 'Albania',
       'United Arab Emirates', 'Argentina', 'Armenia',
       'Antigua and Barbuda', 'Australia', 'Austria', 'Azerbaijan',
       'Burundi', 'Belgium', 'Benin', 'Burkina Faso', 'Bangladesh',
       'Bulgaria', 'Bahrain', 'Bahamas, The', 'Bosnia and Herzegovina',
       'Belarus', 'Belize', 'Bermuda', 'Bolivia', 'Brazil', 'Barbados',
       'Brunei Darussalam', 'Bhutan', 'Botswana',
       'Central African Republic', 'Canada', 'Switzerland', 'Chile',
       'China', "Cote d'Ivoire", 'Cameroon', 'Congo, Rep.', 'Colombia',
       'Comoros', 'Cabo Verde', 'Costa Rica', 'Cuba', 'Cayman Islands',
       'Cyprus', 'Czech Republic', 'Germany', 'Djibouti', 'Denmark',
       'Dominican Republic', 'Algeria', 'Ecuador', 'Egypt, Arab Rep.',
       'Eritrea', 'Spain', 'Estonia', 'Ethiopia', 'Finland', 'Fiji',
       'France', 'Micronesia, Fed. Sts.', 'Gabon', 'United Kingdom',
       'Georgia', 'Ghana', 'Guinea', 'Gambia, The', 'Guinea-Bissau',
       'Equatorial Guinea', 'Greece', 'Grenada', 'Greenland', 'Guatemala',
       'Guam', 'Guyana', 'Hong Kong SAR, China', 'Honduras', 'Croatia',
       'Haiti', 'Hungary', 'Indonesia', 'India', 'Ireland',
       'Iran, Islamic Rep.', 'Iraq', 'Iceland', 'Israel', 'Italy',
       'Jamaica', 'Jordan', 'Japan', 'Kazakhstan', 'Kenya',
       'Kyrgyz Republic', 'Cambodia', 'Kiribati', 'Korea, Rep.', 'Kuwait',
       'Lao PDR', 'Lebanon', 'Liberia', 'Libya', 'St. Lucia',
       'Liechtenstein', 'Sri Lanka', 'Lesotho', 'Lithuania', 'Luxembourg',
       'Latvia', 'Macao SAR, China', 'Morocco', 'Moldova', 'Madagascar',
       'Maldives', 'Mexico', 'Macedonia, FYR', 'Mali', 'Malta', 'Myanmar',
       'Montenegro', 'Mongolia', 'Mozambique', 'Mauritania', 'Mauritius',
       'Malawi', 'Malaysia', 'Namibia', 'New Caledonia', 'Niger',
       'Nigeria', 'Nicaragua', 'Netherlands', 'Norway', 'Nepal',
       'New Zealand', 'Oman', 'Pakistan', 'Panama', 'Peru', 'Philippines',
       'Papua New Guinea', 'Poland', 'Puerto Rico', 'Portugal',
       'Paraguay', 'French Polynesia', 'Qatar', 'Romania',
       'Russian Federation', 'Rwanda', 'Saudi Arabia', 'Sudan', 'Senegal',
       'Singapore', 'Solomon Islands', 'Sierra Leone', 'El Salvador',
       'Somalia', 'Serbia', 'South Sudan', 'Sao Tome and Principe',
       'Suriname', 'Slovak Republic', 'Slovenia', 'Sweden', 'Swaziland',
       'Seychelles', 'Syrian Arab Republic', 'Chad', 'Togo', 'Thailand',
       'Tajikistan', 'Turkmenistan', 'Timor-Leste', 'Tonga',
       'Trinidad and Tobago', 'Tunisia', 'Turkey', 'Tanzania', 'Uganda',
       'Ukraine', 'Uruguay', 'United States', 'Uzbekistan',
       'St. Vincent and the Grenadines', 'Venezuela, RB',
       'Virgin Islands (U.S.)', 'Vietnam', 'Vanuatu',
       'West Bank and Gaza', 'Samoa', 'Yemen, Rep.', 'South Africa',
       'Congo, Dem. Rep.', 'Zambia', 'Zimbabwe'], dtype=object)

In [25]:
df["Name_Country"].to_numpy()

array(['Aruba', 'Afghanistan', 'Angola', 'Albania',
       'United Arab Emirates', 'Argentina', 'Armenia',
       'Antigua and Barbuda', 'Australia', 'Austria', 'Azerbaijan',
       'Burundi', 'Belgium', 'Benin', 'Burkina Faso', 'Bangladesh',
       'Bulgaria', 'Bahrain', 'Bahamas, The', 'Bosnia and Herzegovina',
       'Belarus', 'Belize', 'Bermuda', 'Bolivia', 'Brazil', 'Barbados',
       'Brunei Darussalam', 'Bhutan', 'Botswana',
       'Central African Republic', 'Canada', 'Switzerland', 'Chile',
       'China', "Cote d'Ivoire", 'Cameroon', 'Congo, Rep.', 'Colombia',
       'Comoros', 'Cabo Verde', 'Costa Rica', 'Cuba', 'Cayman Islands',
       'Cyprus', 'Czech Republic', 'Germany', 'Djibouti', 'Denmark',
       'Dominican Republic', 'Algeria', 'Ecuador', 'Egypt, Arab Rep.',
       'Eritrea', 'Spain', 'Estonia', 'Ethiopia', 'Finland', 'Fiji',
       'France', 'Micronesia, Fed. Sts.', 'Gabon', 'United Kingdom',
       'Georgia', 'Ghana', 'Guinea', 'Gambia, The', 'Guinea-Bissau',
       'Equatorial Guinea', 'Greece', 'Grenada', 'Greenland', 'Guatemala',
       'Guam', 'Guyana', 'Hong Kong SAR, China', 'Honduras', 'Croatia',
       'Haiti', 'Hungary', 'Indonesia', 'India', 'Ireland',
       'Iran, Islamic Rep.', 'Iraq', 'Iceland', 'Israel', 'Italy',
       'Jamaica', 'Jordan', 'Japan', 'Kazakhstan', 'Kenya',
       'Kyrgyz Republic', 'Cambodia', 'Kiribati', 'Korea, Rep.', 'Kuwait',
       'Lao PDR', 'Lebanon', 'Liberia', 'Libya', 'St. Lucia',
       'Liechtenstein', 'Sri Lanka', 'Lesotho', 'Lithuania', 'Luxembourg',
       'Latvia', 'Macao SAR, China', 'Morocco', 'Moldova', 'Madagascar',
       'Maldives', 'Mexico', 'Macedonia, FYR', 'Mali', 'Malta', 'Myanmar',
       'Montenegro', 'Mongolia', 'Mozambique', 'Mauritania', 'Mauritius',
       'Malawi', 'Malaysia', 'Namibia', 'New Caledonia', 'Niger',
       'Nigeria', 'Nicaragua', 'Netherlands', 'Norway', 'Nepal',
       'New Zealand', 'Oman', 'Pakistan', 'Panama', 'Peru', 'Philippines',
       'Papua New Guinea', 'Poland', 'Puerto Rico', 'Portugal',
       'Paraguay', 'French Polynesia', 'Qatar', 'Romania',
       'Russian Federation', 'Rwanda', 'Saudi Arabia', 'Sudan', 'Senegal',
       'Singapore', 'Solomon Islands', 'Sierra Leone', 'El Salvador',
       'Somalia', 'Serbia', 'South Sudan', 'Sao Tome and Principe',
       'Suriname', 'Slovak Republic', 'Slovenia', 'Sweden', 'Swaziland',
       'Seychelles', 'Syrian Arab Republic', 'Chad', 'Togo', 'Thailand',
       'Tajikistan', 'Turkmenistan', 'Timor-Leste', 'Tonga',
       'Trinidad and Tobago', 'Tunisia', 'Turkey', 'Tanzania', 'Uganda',
       'Ukraine', 'Uruguay', 'United States', 'Uzbekistan',
       'St. Vincent and the Grenadines', 'Venezuela, RB',
       'Virgin Islands (U.S.)', 'Vietnam', 'Vanuatu',
       'West Bank and Gaza', 'Samoa', 'Yemen, Rep.', 'South Africa',
       'Congo, Dem. Rep.', 'Zambia', 'Zimbabwe'], dtype=object)

### * Filtering :-

- selecting or extracting the data based on condition

- Using first condition.
- Syntex :- df['condition']

In [28]:
df['InternetUsers'] >= 7

0       True
1      False
2       True
3       True
4       True
       ...
190     True
191     True
192    False
193     True
194     True
Name: InternetUsers, Length: 195, dtype: bool

In [27]:
df

,Name_Country,Code_Country,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [29]:
# creating a new DataFrame here
df1 = pd.DataFrame({'x':[1,2,3,4,5],'y':[6,7,8,9,10]})

In [30]:
df1

   x   y
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [31]:
df1 ['x'] >= 3

0    False
1    False
2     True
3     True
4     True
Name: x, dtype: bool

In [36]:
df1  ['x'] <= 3

0     True
1     True
2     True
3    False
4    False
Name: x, dtype: bool

In [37]:
# Now extracting the data
df1[df1['x']>= 3]

   x   y
2  3   8
3  4   9
4  5  10

In [38]:
df1[df1['y']>= 3]

   x   y
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [39]:
df1[df1['y']== 3]  # there is no value which is eqaul to the value of y Data.

Empty DataFrame
Columns: [x, y]
Index: []

In [40]:
df1[df1["y"]==7]

   x  y
1  2  7

In [43]:
df1[(df1['x'] > 3) & (df1['y'] >= 7)]

   x   y
3  4   9
4  5  10

In [42]:
df1[(df1['x'] > 3) | (df1['y']>= 7)]

   x   y
1  2   7
2  3   8
3  4   9
4  5  10

In [44]:
df[df["IncomeGroup"]=="High income"]  # I want to see howmuch high income are.

              Name_Country Code_Country  BirthRate  InternetUsers  IncomeGroup
0                    Aruba          ABW     10.244          78.90  High income
4     United Arab Emirates          ARE     11.044          88.00  High income
5                Argentina          ARG     17.716          59.90  High income
7      Antigua and Barbuda          ATG     16.447          63.40  High income
8                Australia          AUS     13.200          83.00  High income
..                     ...          ...        ...            ...          ...
174    Trinidad and Tobago          TTO     14.590          63.80  High income
180                Uruguay          URY     14.374          57.69  High income
181          United States          USA     12.500          84.20  High income
184          Venezuela, RB          VEN     19.842          54.90  High income
185  Virgin Islands (U.S.)          VIR     10.700          45.30  High income

[67 rows x 5 columns]

In [46]:
df1 = pd.DataFrame({"X":[1,2,3,4,5],"Y":[6,7,8,9,10],"Z":[11,12,13,14,15]})
df1

   X   Y   Z
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

### Numerical data is called quantitaive.

### Non-Numerical data is called qualitative.